test-performance.yml
config:
  target: "https://examen-fin-carrera-ou8f.onrender.com"
  phases:
    - duration: 60
      arrivalRate: 10  # 10 usuarios por segundo
      name: "Carga baja"
    - duration: 120
      arrivalRate: 20  # 20 usuarios por segundo
      name: "Carga media"
    - duration: 60
      arrivalRate: 50  # 50 usuarios por segundo
      name: "Carga alta"
  http:
    timeout: 20  # Máximo 20 segundos de espera por respuesta
scenarios:
  - flow:
      - get:
          url: "/caso5/reserva/bienvenido"
      - post:
          url: "/caso5/usuarios/registro"
          json:
            email: "testuser@example.com"
            password: "123456"
  - flow:
      - post:
          url: "/caso5/usuarios/login"
          json:
            email: "testuser@example.com"
            password: "123456"
      - get:
          url: "/caso5/reserva/ver"
          headers:
            Authorization: "Bearer {{ token }}"
      - get:
          url: "/caso5/reserva/ver/1"
          headers:
            Authorization: "Bearer {{ token }}"
  - flow:
      - post:
          url: "/caso5/conferencista/crear"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            nombre: "Juan Pérez"
            apellido: "Gómez"
            cedula: "123456789"
            genero: "Masculino"
            ciudad: "Ciudad de México"
            direccion: "Calle Falsa 123"
            fecha_nacimiento: "1990-01-01"
            telefono: "5555555555"
            email: "juan.perez@example.com"
            empresa: "Empresa XYZ"
      - get:
          url: "/caso5/conferencista/ver"
          headers:
            Authorization: "Bearer {{ token }}"
      - put:
          url: "/caso5/conferencista/actualizar/1"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            nombre: "Juan Pérez Actualizado"
      - delete:
          url: "/caso5/conferencista/eliminar/1"
          headers:
            Authorization: "Bearer {{ token }}"
  - flow:
      - post:
          url: "/caso5/reserva/crear"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            codigo: "RES001"
            descripcion: "Reserva para la conferencia de tecnología"
            conferencista: "ID_DEL_CONFERENCISTA"  # Reemplaza con un ID de conferencista existente
            auditorio: ["ID_DEL_AUDITORIO_1", "ID_DEL_AUDITORIO_2"]  # Reemplaza con IDs de auditorios existentes
      - get:
          url: "/caso5/reserva/ver"
          headers:
            Authorization: "Bearer {{ token }}"
      - put:
          url: "/caso5/reserva/actualizar/1"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            descripcion: "Reserva actualizada para la conferencia de ciencia"
      - delete:
          url: "/caso5/reserva/eliminar/1"
          headers:
            Authorization: "Bearer {{ token }}"